pib = input("Ваші прізвище, ім'я, по батькові? ")
age = input("Скільки Вам років? ")
residence = input("Де Ви живете? ")
study_place = input("Де Ви навчаєтесь? ")
group_number = input("Номер Вашої групи? ")
position_in_group = input("Який Ваш порядковий номер у списку групи? ")

print("\nВаше ім'я:", pib)
print("Ваш вік:", age)
print("Ви живете в:", residence)
print("Ви навчаєтесь в:", study_place)
print("Номер моєї групи -", group_number)
print("Мій порядковий номер у списку групи -", position_in_group)

questions = [
    "Як справи?",
    "Як Ви себе почуваєте?",
    "Коли будете вдома?",
    "Яку оцінку отримав на ЗНО по українській мові?",
    "Сьогодні сонячно?",
    "Коли нарешті карантин?",
    "Як звати Вашого друга?",
    "Ви думаєте вступати у магістратуру?",
    "Якого кольору Ваш зошит?",
    "Який Ваш настрій сьогодні?"
]

for i, question in enumerate(questions):
    answer = input(f"{i + 1}. {question} ")
    print(f"Ваша відповідь на питання {i}: {answer}")
